"""
Количество совпадающих

Даны два списка чисел, которые могут содержать до 100000 чисел каждый
Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором

Примечание. Эту задачу на Питоне можно решить в одну строчку
"""
def get_count_eq(a, b):
	return len(set(a).intersection(set(b)))


# =======================test=======================
assert get_count_eq([1, 3, 2], [4, 3, 2]) == 2
assert get_count_eq([1, 2, 6, 4, 5, 7], [10, 2, 3, 4, 8]) == 2
assert get_count_eq([1, 7, 3, 8, 10, 2, 5], [6, 5, 2, 8, 4, 3, 7]) == 5
# =======================/test=======================


def main():
	a = map(int, input().split())
	b = map(int, input().split())
	print(get_count_eq(a, b))


if __name__ == "__main__":
	main()